1> Read Data, Head and Tail,Shape, Size and Info, Describe are 5 important functions of the pandas library.

2>

In [7]:
data={'a':[1,2,3,4,5],
      'b':['a','b','c','d','e'],
      'c':['isagi','bachira','eren','light','ryuk']}

In [1]:
import pandas as pd

In [24]:
df= pd.DataFrame(data)

In [25]:
df

   a  b        c
0  1  a    isagi
1  2  b  bachira
2  3  c     eren
3  4  d    light
4  5  e     ryuk

In [39]:
def resetindex(df):
    new_index=range(1,len(df)*2+1,2)
    df=df.set_index(pd.Index(new_index))
    return df

In [40]:
resetindex(df)

   a  b        c
1  1  a    isagi
3  2  b  bachira
5  3  c     eren
7  4  d    light
9  5  e     ryuk

3>

In [41]:
data={"name":['isagi','bachira','eren','light','ryuk'],
      "values":[2,4,6,8,10]}

In [42]:
df=pd.DataFrame(data)

In [43]:
df

      name  values
0    isagi       2
1  bachira       4
2     eren       6
3    light       8
4     ryuk      10

In [57]:
def summation(df):
    s=0
    for i in range(0,3):
        s+=df['values'][i]
    print(s)

In [58]:
df['values'][2]

6

In [59]:
summation(df)

12

4>

In [61]:
data={'a':[1,2,3,4,5],
      'text':['isagi','bachira','eren','light','ryuk']}
df=pd.DataFrame(data)
df

   a     text
0  1    isagi
1  2  bachira
2  3     eren
3  4    light
4  5     ryuk

In [66]:
df['word_count']=df['text'].apply(lambda x : len(x))

In [67]:
df

   a     text  word_count
0  1    isagi           5
1  2  bachira           7
2  3     eren           4
3  4    light           5
4  5     ryuk           4

5> DataFrame.size returns the total number of elements present in the dataframe(ie. number of rows multiplied by number of columns).
    
    DataFrame.share returns the dimensions of the data frame (ie. numberofcolumns * numberofrows)

6> pd.read_excel("filename") is used to read an excel file.

7>

In [68]:
data={"email":['isagi@gmail.com','bachira@gmail.com','eren@gmail.com','light@hotmail.com','ryuk@hotmail.com'],
      "age":[18,20,21,24,26]}

In [70]:
df=pd.DataFrame(data)
df

               email  age
0    isagi@gmail.com   18
1  bachira@gmail.com   20
2     eren@gmail.com   21
3  light@hotmail.com   24
4   ryuk@hotmail.com   26

In [75]:
for i in df['email']:
    l=i.split('@')
    print(l[0])

isagi
bachira
eren
light
ryuk

8>

In [54]:
data = {"A":[1,2,5,8,9,7],
        "B":[3,4,6,7,11,8],
        "C":[12,13,14,15,20,50]}
df=pd.DataFrame(data)
df

   A   B   C
0  1   3  12
1  2   4  13
2  5   6  14
3  8   7  15
4  9  11  20
5  7   8  50

In [55]:
def select(df):
    for i in range(len(df)):
        filtered_df=df[(df['A']>5) &(df['B']<10)]
        return (filtered_df)
        #a=df["A"][i]
        #b=df["B"][i]
        #if(a>5 and b<10):
         #   print(df[['A','B','C',[i]]])

In [56]:
print(select(df))

   A  B   C
3  8  7  15
5  7  8  50

In [57]:
def select(df):
    for i in range(len(df)):
        filtered_df=df[(df['A']>5) &(df['B']<10)]
        return (filtered_df[['A','B']])

In [58]:
print(select(df))

   A  B
3  8  7
5  7  8

9>

In [64]:
data={"name":['isagi','bachira','eren','light','ryuk'],
      "values":[2,4,6,8,10]}

In [65]:
df=pd.DataFrame(data)
df

      name  values
0    isagi       2
1  bachira       4
2     eren       6
3    light       8
4     ryuk      10

In [69]:
df['values'].mean()

6.0

In [71]:
df['values'].median()

6.0

In [72]:
df['values'].std()

3.1622776601683795

10>

In [73]:
data={"date":['1/1/23','2/1/23','4/1/23','5/1/23','6/1/23','7/1/23','8/1/23'],
      "sales":[1000,500,2100,2300,3200,5000,5500]}
df=pd.DataFrame(data)
df

     date  sales
0  1/1/23   1000
1  2/1/23    500
2  4/1/23   2100
3  5/1/23   2300
4  6/1/23   3200
5  7/1/23   5000
6  8/1/23   5500

In [75]:
def moving_sales(df):
    ma=df['sales'].rolling(window=7).mean()
    return ma

In [76]:
moving_sales(df)

0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
5       NaN
6    2800.0
Name: sales, dtype: float64

11>

In [9]:
data={"Date":['2023-01-01',"2023-01-02",'2023-01-03','2023-01-04',"2023-01-05"]}
df=pd.DataFrame(data)

In [10]:
def add_wekday(df):
    df['Date']=pd.to_datetime(df['Date'])
    df['Weekday']=df['Date'].dt.day_name()
    return df

In [11]:
add_wekday(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

12>

In [31]:
def timestamp(df):
    #df['Date'] = pd.to_datetime(df['Date'])
    #for i in range(len(df)+1):
    a=df[(df['Date']<'2023-01-05'])&(df['Date']>'2023-01-01')]
    print(a)

SyntaxError: closing parenthesis ']' does not match opening parenthesis '(' (356111016.py, line 4)

In [30]:
timestamp(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday